# 7/20

__python__

In [1]:
# timestamp -> str
import time
print(time.time(),type(time.time()))

timestamp = time.time()
s = str(timestamp)
print(s,type(s))

1641748758.814023 <class 'float'>
1641748758.814229 <class 'str'>

In [3]:
# datetime -> str
from datetime import datetime
s = datetime.now()
print(s, type(s))

s1 = datetime.now().strftime('%Y-%m-%d %H:%M:%S') ### string_for_time
print(s1, type(s1))

2022-01-10 02:20:05.072433 <class 'datetime.datetime'>
2022-01-10 02:20:05 <class 'str'>

In [4]:
# str -> datetime
from datetime import datetime
s = '2021-07-20 11:13:58'
d = datetime.strptime(s,'%Y-%m-%d %H:%M:%S') ### 문자를 time으로 parsing한다는 의미
print(d, type(d))

2021-07-20 11:13:58 <class 'datetime.datetime'>

In [5]:
s = '2021/7/20'
d = datetime.strptime(s,'%Y/%m/%d')
print(d,type(d))

2021-07-20 00:00:00 <class 'datetime.datetime'>

In [6]:
d.timetuple()

time.struct_time(tm_year=2021, tm_mon=7, tm_mday=20, tm_hour=0, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=201, tm_isdst=-1)

In [7]:
# str -> timestamp
s = '2021-07-20 11:13:58'
timestamp = time.mktime(datetime.strptime(s,'%Y-%m-%d %H:%M:%S').timetuple())
print(timestamp, type(timestamp))

1626747238.0 <class 'float'>

In [8]:
# datetime -> timestamp
s = '2021-07-20 11:13:58'
timestamp = time.mktime(datetime.today().timetuple())
print(timestamp, type(timestamp))

1641748849.0 <class 'float'>

In [9]:
# timestamp -> datetime
t = time.time()
print(t)
d = datetime.fromtimestamp(t)
print(d, type(d))

1641748855.4452312
2022-01-10 02:20:55.445231 <class 'datetime.datetime'>

In [10]:
datetime.fromtimestamp(time.time())

datetime.datetime(2022, 1, 10, 2, 20, 56, 860540)

In [11]:
print(datetime.fromtimestamp(time.time()))

2022-01-10 02:21:00.111034

In [12]:
# 1년전 datetime 값
from datetime import timedelta
import time

datetime_now = datetime.now()
delta_datetime = timedelta(days =- 365)
print(delta_datetime)
datetime_now + delta_datetime

-365 days, 0:00:00

datetime.datetime(2021, 1, 10, 2, 21, 4, 723948)

In [13]:
# 두 날짜간의 일수 구하기
sinse_timestamp = datetime.strptime('20180301', '%Y%m%d')
until_timestamp = datetime.strptime('20180331', '%Y%m%d')
result = until_timestamp - sinse_timestamp
result

datetime.timedelta(days=30)

In [18]:
# 특정일 구하기
import datetime
def get_yoil(y,m,d):
    days = ['MON','TUE','WED','THU','FRI','SAT','SUN']
    return days[datetime.date(y,m,d).weekday()] # datetime.date(y,m,d).weekday() 하면 숫자로 요일이 나옴.

get_yoil(2021,7,20)

'TUE'

__pandas__

In [22]:
# 판다스 to_datetime
import pandas as pd
pd.to_datetime(1626751324.6826663,unit='s') ### time.time 안에 넣음 ### 결과값을 pandas의 timestamp라고 부름

### unit='s' 안넣으면 1970-01-01 나옴..

Timestamp('2021-07-20 03:22:04.682666240')

In [23]:
time.time()

1641748970.74536

In [24]:
pd.to_datetime(time.time())

Timestamp('1970-01-01 00:00:01.641748971')

In [25]:
import pandas as pd
date = pd.Timestamp(1626747931.0,unit='s',tz='Asia/Seoul') ### tz = timezone
print(date,type(date))

2021-07-20 11:25:31+09:00 <class 'pandas._libs.tslibs.timestamps.Timestamp'>

In [26]:
### 참고 - tz(time zone) 확인(Asia 지역)
# time zone information
import pytz
# regular expression in Python
import re
# regular expression for pattern containing 'Asia' texts
pattern = re.compile(r'^Asia')
# list comprehension for selecting 'Asia****' time zones
tz_asia = [x for x in pytz.common_timezones if pattern.match(x)]
tz_asia

['Asia/Aden',
 'Asia/Almaty',
 'Asia/Amman',
 'Asia/Anadyr',
 'Asia/Aqtau',
 'Asia/Aqtobe',
 'Asia/Ashgabat',
 'Asia/Atyrau',
 'Asia/Baghdad',
 'Asia/Bahrain',
 'Asia/Baku',
 'Asia/Bangkok',
 'Asia/Barnaul',
 'Asia/Beirut',
 'Asia/Bishkek',
 'Asia/Brunei',
 'Asia/Chita',
 'Asia/Choibalsan',
 'Asia/Colombo',
 'Asia/Damascus',
 'Asia/Dhaka',
 'Asia/Dili',
 'Asia/Dubai',
 'Asia/Dushanbe',
 'Asia/Famagusta',
 'Asia/Gaza',
 'Asia/Hebron',
 'Asia/Ho_Chi_Minh',
 'Asia/Hong_Kong',
 'Asia/Hovd',
 'Asia/Irkutsk',
 'Asia/Jakarta',
 'Asia/Jayapura',
 'Asia/Jerusalem',
 'Asia/Kabul',
 'Asia/Kamchatka',
 'Asia/Karachi',
 'Asia/Kathmandu',
 'Asia/Khandyga',
 'Asia/Kolkata',
 'Asia/Krasnoyarsk',
 'Asia/Kuala_Lumpur',
 'Asia/Kuching',
 'Asia/Kuwait',
 'Asia/Macau',
 'Asia/Magadan',
 'Asia/Makassar',
 'Asia/Manila',
 'Asia/Muscat',
 'Asia/Nicosia',
 'Asia/Novokuznetsk',
 'Asia/Novosibirsk',
 'Asia/Omsk',
 'Asia/Oral',
 'Asia/Phnom_Penh',
 'Asia/Pontianak',
 'Asia/Pyongyang',
 'Asia/Qatar',
 'Asia/Qostanay',
 'Asia/Qyzylorda',
 'Asia/Riyadh',
 'Asia/Sakhalin',
 'Asia/Samarkand',
 'Asia/Seoul',
 'Asia/Shanghai',
 'Asia/Singapore',
 'Asia/Srednekolymsk',
 'Asia/Taipei',
 'Asia/Tashkent',
 'Asia/Tbilisi',
 'Asia/Tehran',
 'Asia/Thimphu',
 'Asia/Tokyo',
 'Asia/Tomsk',
 'Asia/Ulaanbaatar',
 'Asia/Urumqi',
 'Asia/Ust-Nera',
 'Asia/Vientiane',
 'Asia/Vladivostok',
 'Asia/Yakutsk',
 'Asia/Yangon',
 'Asia/Yekaterinburg',
 'Asia/Yerevan']

In [27]:
df = pd.read_csv('stock-data.csv')
df.head()

         Date  Close  Start   High    Low  Volume
0  2018-07-02  10100  10850  10900  10000  137977
1  2018-06-29  10700  10550  10900   9990  170253
2  2018-06-28  10400  10900  10950  10150  155769
3  2018-06-27  10900  10800  11050  10500  133548
4  2018-06-26  10800  10900  11000  10700   63039

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    20 non-null     object
 1   Close   20 non-null     int64
 2   Start   20 non-null     int64
 3   High    20 non-null     int64
 4   Low     20 non-null     int64
 5   Volume  20 non-null     int64
dtypes: int64(5), object(1)
memory usage: 1.1+ KB

In [29]:
df['Date']

0     2018-07-02
1     2018-06-29
2     2018-06-28
3     2018-06-27
4     2018-06-26
5     2018-06-25
6     2018-06-22
7     2018-06-21
8     2018-06-20
9     2018-06-19
10    2018-06-18
11    2018-06-15
12    2018-06-14
13    2018-06-12
14    2018-06-11
15    2018-06-08
16    2018-06-07
17    2018-06-05
18    2018-06-04
19    2018-06-01
Name: Date, dtype: object

In [30]:
df['New_Date'] = pd.to_datetime(df['Date']) ### str 인 Date 컬럼 -> datetime으로 만든 New_Date 컬럼 추가
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      20 non-null     object
 1   Close     20 non-null     int64
 2   Start     20 non-null     int64
 3   High      20 non-null     int64
 4   Low       20 non-null     int64
 5   Volume    20 non-null     int64
 6   New_Date  20 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(5), object(1)
memory usage: 1.2+ KB

In [31]:
df.drop('Date',axis=1,inplace=True) ### New_Date 있으니까 버리기
df['year'] = df['New_Date'].dt.year
df['month'] = df['New_Date'].dt.month
df['day'] = df['New_Date'].dt.day
df.head()

   Close  Start   High    Low  Volume   New_Date  year  month  day
0  10100  10850  10900  10000  137977 2018-07-02  2018      7    2
1  10700  10550  10900   9990  170253 2018-06-29  2018      6   29
2  10400  10900  10950  10150  155769 2018-06-28  2018      6   28
3  10900  10800  11050  10500  133548 2018-06-27  2018      6   27
4  10800  10900  11000  10700   63039 2018-06-26  2018      6   26

In [32]:
df.set_index('New_Date',inplace=True)
df.head()

            Close  Start   High    Low  Volume  year  month  day
New_Date
2018-07-02  10100  10850  10900  10000  137977  2018      7    2
2018-06-29  10700  10550  10900   9990  170253  2018      6   29
2018-06-28  10400  10900  10950  10150  155769  2018      6   28
2018-06-27  10900  10800  11050  10500  133548  2018      6   27
2018-06-26  10800  10900  11000  10700   63039  2018      6   26

In [33]:
df.index

DatetimeIndex(['2018-07-02', '2018-06-29', '2018-06-28', '2018-06-27',
               '2018-06-26', '2018-06-25', '2018-06-22', '2018-06-21',
               '2018-06-20', '2018-06-19', '2018-06-18', '2018-06-15',
               '2018-06-14', '2018-06-12', '2018-06-11', '2018-06-08',
               '2018-06-07', '2018-06-05', '2018-06-04', '2018-06-01'],
              dtype='datetime64[ns]', name='New_Date', freq=None)

In [35]:
df_ymd_range = df['2018-06-26':'2018-06-29'] ### 날짜순 슬라이싱이 아닌 df 인덱스의 슬라이싱!
df_ymd_range

            Close  Start   High    Low  Volume  year  month  day
New_Date
2018-06-29  10700  10550  10900   9990  170253  2018      6   29
2018-06-28  10400  10900  10950  10150  155769  2018      6   28
2018-06-27  10900  10800  11050  10500  133548  2018      6   27

In [36]:
df_ym = df.loc['2018-07']
df_ym

            Close  Start   High    Low  Volume  year  month  day
New_Date
2018-07-02  10100  10850  10900  10000  137977  2018      7    2

In [37]:
# Time Series Basics

import numpy as np
import pandas as pd
from datetime import datetime
dates = [datetime(2011,1,2),datetime(2011,1,2),
        datetime(2011,1,7),datetime(2011,1,8),
        datetime(2011,1,10),datetime(2011,1,12)] 
ts = pd.Series(np.random.randn(6), index=dates) ### randn 은 표준정규분포에서 샘플링한 난수 반환
ts

2011-01-02    1.349013
2011-01-02    0.183756
2011-01-07   -0.201122
2011-01-08    1.861460
2011-01-10    0.600513
2011-01-12    1.286857
dtype: float64

In [38]:
ts.index

DatetimeIndex(['2011-01-02', '2011-01-02', '2011-01-07', '2011-01-08',
               '2011-01-10', '2011-01-12'],
              dtype='datetime64[ns]', freq=None)

In [39]:
ts[::2]

2011-01-02    1.349013
2011-01-07   -0.201122
2011-01-10    0.600513
dtype: float64

In [40]:
ts + ts[::2] ### ts[::2]에 없는 인덱스(2011-01-08,2011-01-12)는 NaN이 되고, 
### ts와 ts[::2] 인덱스 같은 것 끼리 더해짐
### 2011-01-02처럼 같은 인덱스 여러개 있는 경우, 동일하게 다 더해짐!

2011-01-02    2.698026
2011-01-02    1.532769
2011-01-07   -0.402245
2011-01-08         NaN
2011-01-10    1.201025
2011-01-12         NaN
dtype: float64

In [41]:
ts.index[0]

Timestamp('2011-01-02 00:00:00')

In [42]:
ts.index[2]

Timestamp('2011-01-07 00:00:00')

In [43]:
# Indexing, Selection, Subsetting
stamp = ts.index[2]
ts[stamp]

-0.20112247542389494

In [44]:
# 2011-01-10    1.089753
print(ts['1/10/2011']) ### 표현이 달라도 알아서 인식함
ts['20110110']

0.6005126078435029

0.6005126078435029

In [45]:
longer_ts = pd.Series(np.random.randn(1000),
                     index = pd.date_range('1/1/2000', periods = 1000)) ### range 2000.1.1부터 하루씩 1000일
print(longer_ts,'\n')

2000-01-01   -0.443243
2000-01-02   -1.837069
2000-01-03    0.968654
2000-01-04   -0.539764
2000-01-05   -1.881831
                ...
2002-09-22   -0.582800
2002-09-23   -0.349628
2002-09-24    0.040350
2002-09-25    0.076248
2002-09-26    0.541007
Freq: D, Length: 1000, dtype: float64

In [47]:
longer_ts['2001'] ### 인덱스 다 입력 안해도 2001년도만 뽑아줌

2001-01-01   -0.388502
2001-01-02   -0.168791
2001-01-03    0.708837
2001-01-04    0.511791
2001-01-05   -1.070712
                ...
2001-12-27    0.247256
2001-12-28   -0.442872
2001-12-29    0.474542
2001-12-30    0.400551
2001-12-31   -0.412641
Freq: D, Length: 365, dtype: float64

In [48]:
longer_ts['2001/05'] ### 년도/월까지 뽑rl

2001-05-01    1.999364
2001-05-02   -0.676287
2001-05-03   -1.530256
2001-05-04   -1.375676
2001-05-05    0.275084
2001-05-06    0.184868
2001-05-07   -1.620718
2001-05-08   -1.011855
2001-05-09   -0.876020
2001-05-10   -0.997979
2001-05-11    1.107001
2001-05-12   -0.428649
2001-05-13   -0.804766
2001-05-14    0.409463
2001-05-15    1.315120
2001-05-16    0.548704
2001-05-17   -0.531163
2001-05-18    1.330929
2001-05-19   -0.672634
2001-05-20   -1.215581
2001-05-21    1.232940
2001-05-22    0.630511
2001-05-23    0.913805
2001-05-24    1.526718
2001-05-25   -0.719459
2001-05-26   -0.267135
2001-05-27    0.617971
2001-05-28   -0.903266
2001-05-29   -0.524697
2001-05-30   -1.529386
2001-05-31    0.448432
Freq: D, dtype: float64

In [49]:
ts[datetime(2011,1,7):]

2011-01-07   -0.201122
2011-01-08    1.861460
2011-01-10    0.600513
2011-01-12    1.286857
dtype: float64

In [50]:
# truncate ### 자르기
print(ts.truncate(before='2011-01-07',after='2011-01-10')) ### before=x, after=y -> x 전. y 후 자름(x,y는 안자름)

2011-01-07   -0.201122
2011-01-08    1.861460
2011-01-10    0.600513
dtype: float64

In [51]:
print(ts.truncate(after='1/9/2011')) ### after=y -> y 이후로 자름

2011-01-02    1.349013
2011-01-02    0.183756
2011-01-07   -0.201122
2011-01-08    1.861460
dtype: float64

In [52]:
pd.date_range('2020-10-7','2020-10-20')

DatetimeIndex(['2020-10-07', '2020-10-08', '2020-10-09', '2020-10-10',
               '2020-10-11', '2020-10-12', '2020-10-13', '2020-10-14',
               '2020-10-15', '2020-10-16', '2020-10-17', '2020-10-18',
               '2020-10-19', '2020-10-20'],
              dtype='datetime64[ns]', freq='D')

In [53]:
from datetime import datetime
from datetime import timedelta

now = datetime.now()
in_two_weeks = now + timedelta(weeks=2) ### now + 2주
pd.date_range(datetime.now(),in_two_weeks) ### 범위를 오늘부터 2주뒤까지

DatetimeIndex(['2022-01-10 02:26:02.653295', '2022-01-11 02:26:02.653295',
               '2022-01-12 02:26:02.653295', '2022-01-13 02:26:02.653295',
               '2022-01-14 02:26:02.653295', '2022-01-15 02:26:02.653295',
               '2022-01-16 02:26:02.653295', '2022-01-17 02:26:02.653295',
               '2022-01-18 02:26:02.653295', '2022-01-19 02:26:02.653295',
               '2022-01-20 02:26:02.653295', '2022-01-21 02:26:02.653295',
               '2022-01-22 02:26:02.653295', '2022-01-23 02:26:02.653295'],
              dtype='datetime64[ns]', freq='D')

In [54]:
# periods 매개변수는 date_range 함수에 전달된 시작날짜와 종료날짜를
# periods 매개변수에 전달된 기준의 수만큼 동일하게 나누어 출력
pd.date_range(start='2020-10-01',end='2020-10-20',periods=5)
### 시간까지 포함해서 입력한 수 만큼 동일한 간격으로 나눔

DatetimeIndex(['2020-10-01 00:00:00', '2020-10-05 18:00:00',
               '2020-10-10 12:00:00', '2020-10-15 06:00:00',
               '2020-10-20 00:00:00'],
              dtype='datetime64[ns]', freq=None)

In [55]:
pd.date_range('2012-05-02 12:56:31', periods = 5, normalize=True) ### normalize=True 하면 날짜만 나옴
### range에 넣은 날 부터 periods 수의 날 만큼까지

DatetimeIndex(['2012-05-02', '2012-05-03', '2012-05-04', '2012-05-05',
               '2012-05-06'],
              dtype='datetime64[ns]', freq='D')

freq 매개변수에 사용되는 Frequncy strings
- A >> calendar year end frequency
- B	>> business day frequency
- C	>> custom business day frequency
- D	>> calendar day frequency
- W	>> weekly frequency
- M	>> month end frequency
- SM >> semi-month end frequency (15th and end of month)
- BM >> business month end frequency
- CBM >> custom business month end frequency
- MS >> month start frequency
- SMS >> semi-month start frequency (1st and 15th)
- BMS >> business month start frequency
- CBMS >> custom business month start frequency
- Q >> quarter end frequency

In [56]:
import numpy as np
dates = pd.date_range('1/1/2000', periods=100, freq='W-WED') ### 매주 수요일 간격으로 설정
print(dates)

DatetimeIndex(['2000-01-05', '2000-01-12', '2000-01-19', '2000-01-26',
               '2000-02-02', '2000-02-09', '2000-02-16', '2000-02-23',
               '2000-03-01', '2000-03-08', '2000-03-15', '2000-03-22',
               '2000-03-29', '2000-04-05', '2000-04-12', '2000-04-19',
               '2000-04-26', '2000-05-03', '2000-05-10', '2000-05-17',
               '2000-05-24', '2000-05-31', '2000-06-07', '2000-06-14',
               '2000-06-21', '2000-06-28', '2000-07-05', '2000-07-12',
               '2000-07-19', '2000-07-26', '2000-08-02', '2000-08-09',
               '2000-08-16', '2000-08-23', '2000-08-30', '2000-09-06',
               '2000-09-13', '2000-09-20', '2000-09-27', '2000-10-04',
               '2000-10-11', '2000-10-18', '2000-10-25', '2000-11-01',
               '2000-11-08', '2000-11-15', '2000-11-22', '2000-11-29',
               '2000-12-06', '2000-12-13', '2000-12-20', '2000-12-27',
               '2001-01-03', '2001-01-10', '2001-01-17', '2001-01-24',
               '2001-01-31', '2001-02-07', '2001-02-14', '2001-02-21',
               '2001-02-28', '2001-03-07', '2001-03-14', '2001-03-21',
               '2001-03-28', '2001-04-04', '2001-04-11', '2001-04-18',
               '2001-04-25', '2001-05-02', '2001-05-09', '2001-05-16',
               '2001-05-23', '2001-05-30', '2001-06-06', '2001-06-13',
               '2001-06-20', '2001-06-27', '2001-07-04', '2001-07-11',
               '2001-07-18', '2001-07-25', '2001-08-01', '2001-08-08',
               '2001-08-15', '2001-08-22', '2001-08-29', '2001-09-05',
               '2001-09-12', '2001-09-19', '2001-09-26', '2001-10-03',
               '2001-10-10', '2001-10-17', '2001-10-24', '2001-10-31',
               '2001-11-07', '2001-11-14', '2001-11-21', '2001-11-28'],
              dtype='datetime64[ns]', freq='W-WED')

In [57]:
long_df = pd.DataFrame(np.random.randn(100,4),
                      index = dates,
                      columns = ['Colorado','Texas','New York','Ohio'])
print(long_df,'\n')
long_df.loc['2001-06'] ### 2001-06만 보기

            Colorado     Texas  New York      Ohio
2000-01-05  1.593388  0.234168 -0.873761 -0.425124
2000-01-12 -1.251838  0.624370  0.463589  0.912833
2000-01-19 -0.156623 -0.560308 -1.692450  1.021123
2000-01-26  2.089746  1.880892 -0.139069  1.485219
2000-02-02  1.028679  2.053176 -0.522903  1.192613
...              ...       ...       ...       ...
2001-10-31 -1.329808 -1.383778  0.159931  1.737335
2001-11-07 -0.917415  0.512790  0.353080 -0.488053
2001-11-14  0.418068  0.799674 -0.487090  0.376039
2001-11-21 -0.319277  0.988083  0.339607  0.121116
2001-11-28 -0.084787 -0.371821  0.258158 -1.606321

[100 rows x 4 columns]

            Colorado     Texas  New York      Ohio
2001-06-06  0.896163 -1.235763  2.649754  0.080164
2001-06-13  2.625813 -1.174960 -0.327806 -1.115465
2001-06-20  0.004679 -0.941806 -2.735752 -0.261407
2001-06-27  1.235746  0.299654 -1.780422  0.520302

In [58]:
dates = pd.DatetimeIndex(['1/1/2000','1/2/2000','1/2/2000','1/2/2000',
                         '1/3/2000'])
dup_ts = pd.Series(np.arange(5),index=dates)
dup_ts

2000-01-01    0
2000-01-02    1
2000-01-02    2
2000-01-02    3
2000-01-03    4
dtype: int64

In [59]:
type(dates)

pandas.core.indexes.datetimes.DatetimeIndex

In [60]:
dup_ts.index.is_unique ### 같은 날짜 3개 있는게 있으므로 False

False

In [61]:
dup_ts['1/3/2000'] # not duplicated의 경우 스칼라 값 ### value

4

In [62]:
dup_ts['1/2/2000'] # duplicated의 경우 슬라이스 출력 ### values

2000-01-02    1
2000-01-02    2
2000-01-02    3
dtype: int64

In [63]:
grouped = dup_ts.groupby(level=0)
print(grouped.mean())
grouped.count()

2000-01-01    0.0
2000-01-02    2.0
2000-01-03    4.0
dtype: float64

2000-01-01    1
2000-01-02    3
2000-01-03    1
dtype: int64

In [64]:
pd.date_range('2000-01-01','2000-01-03 23:59',freq='4h')
### 시작일에 시간 안 주면 00:00:00

DatetimeIndex(['2000-01-01 00:00:00', '2000-01-01 04:00:00',
               '2000-01-01 08:00:00', '2000-01-01 12:00:00',
               '2000-01-01 16:00:00', '2000-01-01 20:00:00',
               '2000-01-02 00:00:00', '2000-01-02 04:00:00',
               '2000-01-02 08:00:00', '2000-01-02 12:00:00',
               '2000-01-02 16:00:00', '2000-01-02 20:00:00',
               '2000-01-03 00:00:00', '2000-01-03 04:00:00',
               '2000-01-03 08:00:00', '2000-01-03 12:00:00',
               '2000-01-03 16:00:00', '2000-01-03 20:00:00'],
              dtype='datetime64[ns]', freq='4H')

In [65]:
from pandas.tseries.offsets import Hour, Minute
Hour(2) + Minute(30) ### min으로 환산되서 나옴!

In [66]:
pd.date_range('2000-01-01',periods=10,freq='1h30min')

DatetimeIndex(['2000-01-01 00:00:00', '2000-01-01 01:30:00',
               '2000-01-01 03:00:00', '2000-01-01 04:30:00',
               '2000-01-01 06:00:00', '2000-01-01 07:30:00',
               '2000-01-01 09:00:00', '2000-01-01 10:30:00',
               '2000-01-01 12:00:00', '2000-01-01 13:30:00'],
              dtype='datetime64[ns]', freq='90T')

In [67]:
rng = pd.date_range('2000-01-01','2012-09-01',freq='WOM-3FRI') ### WOM(week of month)
rng
list(rng)

[Timestamp('2000-01-21 00:00:00', freq='WOM-3FRI'),
 Timestamp('2000-02-18 00:00:00', freq='WOM-3FRI'),
 Timestamp('2000-03-17 00:00:00', freq='WOM-3FRI'),
 Timestamp('2000-04-21 00:00:00', freq='WOM-3FRI'),
 Timestamp('2000-05-19 00:00:00', freq='WOM-3FRI'),
 Timestamp('2000-06-16 00:00:00', freq='WOM-3FRI'),
 Timestamp('2000-07-21 00:00:00', freq='WOM-3FRI'),
 Timestamp('2000-08-18 00:00:00', freq='WOM-3FRI'),
 Timestamp('2000-09-15 00:00:00', freq='WOM-3FRI'),
 Timestamp('2000-10-20 00:00:00', freq='WOM-3FRI'),
 Timestamp('2000-11-17 00:00:00', freq='WOM-3FRI'),
 Timestamp('2000-12-15 00:00:00', freq='WOM-3FRI'),
 Timestamp('2001-01-19 00:00:00', freq='WOM-3FRI'),
 Timestamp('2001-02-16 00:00:00', freq='WOM-3FRI'),
 Timestamp('2001-03-16 00:00:00', freq='WOM-3FRI'),
 Timestamp('2001-04-20 00:00:00', freq='WOM-3FRI'),
 Timestamp('2001-05-18 00:00:00', freq='WOM-3FRI'),
 Timestamp('2001-06-15 00:00:00', freq='WOM-3FRI'),
 Timestamp('2001-07-20 00:00:00', freq='WOM-3FRI'),
 Timestamp('2001-08-17 00:00:00', freq='WOM-3FRI'),
 Timestamp('2001-09-21 00:00:00', freq='WOM-3FRI'),
 Timestamp('2001-10-19 00:00:00', freq='WOM-3FRI'),
 Timestamp('2001-11-16 00:00:00', freq='WOM-3FRI'),
 Timestamp('2001-12-21 00:00:00', freq='WOM-3FRI'),
 Timestamp('2002-01-18 00:00:00', freq='WOM-3FRI'),
 Timestamp('2002-02-15 00:00:00', freq='WOM-3FRI'),
 Timestamp('2002-03-15 00:00:00', freq='WOM-3FRI'),
 Timestamp('2002-04-19 00:00:00', freq='WOM-3FRI'),
 Timestamp('2002-05-17 00:00:00', freq='WOM-3FRI'),
 Timestamp('2002-06-21 00:00:00', freq='WOM-3FRI'),
 Timestamp('2002-07-19 00:00:00', freq='WOM-3FRI'),
 Timestamp('2002-08-16 00:00:00', freq='WOM-3FRI'),
 Timestamp('2002-09-20 00:00:00', freq='WOM-3FRI'),
 Timestamp('2002-10-18 00:00:00', freq='WOM-3FRI'),
 Timestamp('2002-11-15 00:00:00', freq='WOM-3FRI'),
 Timestamp('2002-12-20 00:00:00', freq='WOM-3FRI'),
 Timestamp('2003-01-17 00:00:00', freq='WOM-3FRI'),
 Timestamp('2003-02-21 00:00:00', freq='WOM-3FRI'),
 Timestamp('2003-03-21 00:00:00', freq='WOM-3FRI'),
 Timestamp('2003-04-18 00:00:00', freq='WOM-3FRI'),
 Timestamp('2003-05-16 00:00:00', freq='WOM-3FRI'),
 Timestamp('2003-06-20 00:00:00', freq='WOM-3FRI'),
 Timestamp('2003-07-18 00:00:00', freq='WOM-3FRI'),
 Timestamp('2003-08-15 00:00:00', freq='WOM-3FRI'),
 Timestamp('2003-09-19 00:00:00', freq='WOM-3FRI'),
 Timestamp('2003-10-17 00:00:00', freq='WOM-3FRI'),
 Timestamp('2003-11-21 00:00:00', freq='WOM-3FRI'),
 Timestamp('2003-12-19 00:00:00', freq='WOM-3FRI'),
 Timestamp('2004-01-16 00:00:00', freq='WOM-3FRI'),
 Timestamp('2004-02-20 00:00:00', freq='WOM-3FRI'),
 Timestamp('2004-03-19 00:00:00', freq='WOM-3FRI'),
 Timestamp('2004-04-16 00:00:00', freq='WOM-3FRI'),
 Timestamp('2004-05-21 00:00:00', freq='WOM-3FRI'),
 Timestamp('2004-06-18 00:00:00', freq='WOM-3FRI'),
 Timestamp('2004-07-16 00:00:00', freq='WOM-3FRI'),
 Timestamp('2004-08-20 00:00:00', freq='WOM-3FRI'),
 Timestamp('2004-09-17 00:00:00', freq='WOM-3FRI'),
 Timestamp('2004-10-15 00:00:00', freq='WOM-3FRI'),
 Timestamp('2004-11-19 00:00:00', freq='WOM-3FRI'),
 Timestamp('2004-12-17 00:00:00', freq='WOM-3FRI'),
 Timestamp('2005-01-21 00:00:00', freq='WOM-3FRI'),
 Timestamp('2005-02-18 00:00:00', freq='WOM-3FRI'),
 Timestamp('2005-03-18 00:00:00', freq='WOM-3FRI'),
 Timestamp('2005-04-15 00:00:00', freq='WOM-3FRI'),
 Timestamp('2005-05-20 00:00:00', freq='WOM-3FRI'),
 Timestamp('2005-06-17 00:00:00', freq='WOM-3FRI'),
 Timestamp('2005-07-15 00:00:00', freq='WOM-3FRI'),
 Timestamp('2005-08-19 00:00:00', freq='WOM-3FRI'),
 Timestamp('2005-09-16 00:00:00', freq='WOM-3FRI'),
 Timestamp('2005-10-21 00:00:00', freq='WOM-3FRI'),
 Timestamp('2005-11-18 00:00:00', freq='WOM-3FRI'),
 Timestamp('2005-12-16 00:00:00', freq='WOM-3FRI'),
 Timestamp('2006-01-20 00:00:00', freq='WOM-3FRI'),
 Timestamp('2006-02-17 00:00:00', freq='WOM-3FRI'),
 Timestamp('2006-03-17 00:00:00', freq='WOM-3FRI'),
 Timestamp('2006-04-21 00:00:00', freq='WOM-3FRI'),
 Timestamp('2006-05-19 00:00:00', freq='WOM-3FRI'),
 Timestamp('2006-06-16 00:00:00', freq='WOM-3FRI'),
 Timestamp('2006-07-21 00:00:00', freq='WOM-3FRI'),
 Timestamp('2006-08-18 00:00:00', freq='WOM-3FRI'),
 Timestamp('2006-09-15 00:00:00', freq='WOM-3FRI'),
 Timestamp('2006-10-20 00:00:00', freq='WOM-3FRI'),
 Timestamp('2006-11-17 00:00:00', freq='WOM-3FRI'),
 Timestamp('2006-12-15 00:00:00', freq='WOM-3FRI'),
 Timestamp('2007-01-19 00:00:00', freq='WOM-3FRI'),
 Timestamp('2007-02-16 00:00:00', freq='WOM-3FRI'),
 Timestamp('2007-03-16 00:00:00', freq='WOM-3FRI'),
 Timestamp('2007-04-20 00:00:00', freq='WOM-3FRI'),
 Timestamp('2007-05-18 00:00:00', freq='WOM-3FRI'),
 Timestamp('2007-06-15 00:00:00', freq='WOM-3FRI'),
 Timestamp('2007-07-20 00:00:00', freq='WOM-3FRI'),
 Timestamp('2007-08-17 00:00:00', freq='WOM-3FRI'),
 Timestamp('2007-09-21 00:00:00', freq='WOM-3FRI'),
 Timestamp('2007-10-19 00:00:00', freq='WOM-3FRI'),
 Timestamp('2007-11-16 00:00:00', freq='WOM-3FRI'),
 Timestamp('2007-12-21 00:00:00', freq='WOM-3FRI'),
 Timestamp('2008-01-18 00:00:00', freq='WOM-3FRI'),
 Timestamp('2008-02-15 00:00:00', freq='WOM-3FRI'),
 Timestamp('2008-03-21 00:00:00', freq='WOM-3FRI'),
 Timestamp('2008-04-18 00:00:00', freq='WOM-3FRI'),
 Timestamp('2008-05-16 00:00:00', freq='WOM-3FRI'),
 Timestamp('2008-06-20 00:00:00', freq='WOM-3FRI'),
 Timestamp('2008-07-18 00:00:00', freq='WOM-3FRI'),
 Timestamp('2008-08-15 00:00:00', freq='WOM-3FRI'),
 Timestamp('2008-09-19 00:00:00', freq='WOM-3FRI'),
 Timestamp('2008-10-17 00:00:00', freq='WOM-3FRI'),
 Timestamp('2008-11-21 00:00:00', freq='WOM-3FRI'),
 Timestamp('2008-12-19 00:00:00', freq='WOM-3FRI'),
 Timestamp('2009-01-16 00:00:00', freq='WOM-3FRI'),
 Timestamp('2009-02-20 00:00:00', freq='WOM-3FRI'),
 Timestamp('2009-03-20 00:00:00', freq='WOM-3FRI'),
 Timestamp('2009-04-17 00:00:00', freq='WOM-3FRI'),
 Timestamp('2009-05-15 00:00:00', freq='WOM-3FRI'),
 Timestamp('2009-06-19 00:00:00', freq='WOM-3FRI'),
 Timestamp('2009-07-17 00:00:00', freq='WOM-3FRI'),
 Timestamp('2009-08-21 00:00:00', freq='WOM-3FRI'),
 Timestamp('2009-09-18 00:00:00', freq='WOM-3FRI'),
 Timestamp('2009-10-16 00:00:00', freq='WOM-3FRI'),
 Timestamp('2009-11-20 00:00:00', freq='WOM-3FRI'),
 Timestamp('2009-12-18 00:00:00', freq='WOM-3FRI'),
 Timestamp('2010-01-15 00:00:00', freq='WOM-3FRI'),
 Timestamp('2010-02-19 00:00:00', freq='WOM-3FRI'),
 Timestamp('2010-03-19 00:00:00', freq='WOM-3FRI'),
 Timestamp('2010-04-16 00:00:00', freq='WOM-3FRI'),
 Timestamp('2010-05-21 00:00:00', freq='WOM-3FRI'),
 Timestamp('2010-06-18 00:00:00', freq='WOM-3FRI'),
 Timestamp('2010-07-16 00:00:00', freq='WOM-3FRI'),
 Timestamp('2010-08-20 00:00:00', freq='WOM-3FRI'),
 Timestamp('2010-09-17 00:00:00', freq='WOM-3FRI'),
 Timestamp('2010-10-15 00:00:00', freq='WOM-3FRI'),
 Timestamp('2010-11-19 00:00:00', freq='WOM-3FRI'),
 Timestamp('2010-12-17 00:00:00', freq='WOM-3FRI'),
 Timestamp('2011-01-21 00:00:00', freq='WOM-3FRI'),
 Timestamp('2011-02-18 00:00:00', freq='WOM-3FRI'),
 Timestamp('2011-03-18 00:00:00', freq='WOM-3FRI'),
 Timestamp('2011-04-15 00:00:00', freq='WOM-3FRI'),
 Timestamp('2011-05-20 00:00:00', freq='WOM-3FRI'),
 Timestamp('2011-06-17 00:00:00', freq='WOM-3FRI'),
 Timestamp('2011-07-15 00:00:00', freq='WOM-3FRI'),
 Timestamp('2011-08-19 00:00:00', freq='WOM-3FRI'),
 Timestamp('2011-09-16 00:00:00', freq='WOM-3FRI'),
 Timestamp('2011-10-21 00:00:00', freq='WOM-3FRI'),
 Timestamp('2011-11-18 00:00:00', freq='WOM-3FRI'),
 Timestamp('2011-12-16 00:00:00', freq='WOM-3FRI'),
 Timestamp('2012-01-20 00:00:00', freq='WOM-3FRI'),
 Timestamp('2012-02-17 00:00:00', freq='WOM-3FRI'),
 Timestamp('2012-03-16 00:00:00', freq='WOM-3FRI'),
 Timestamp('2012-04-20 00:00:00', freq='WOM-3FRI'),
 Timestamp('2012-05-18 00:00:00', freq='WOM-3FRI'),
 Timestamp('2012-06-15 00:00:00', freq='WOM-3FRI'),
 Timestamp('2012-07-20 00:00:00', freq='WOM-3FRI'),
 Timestamp('2012-08-17 00:00:00', freq='WOM-3FRI')]

In [68]:
datetime(2021,7,20)

datetime.datetime(2021, 7, 20, 0, 0)

In [69]:
from pandas.tseries.offsets import Day, MonthEnd
now = datetime(2011, 11, 17)
now + 3 * Day() ### 3일 더해주기!

Timestamp('2011-11-20 00:00:00')

In [70]:
offset = MonthEnd() ### 달의 마지막 날
print(offset.rollforward(now)) ### 해당 달의 마지막 날
offset.rollback(now) ### 전 달의 마지막 날

2011-11-30 00:00:00

Timestamp('2011-10-31 00:00:00')

# 7/21

In [71]:
# Periods and Period Arithmetic
import pandas as pd

p = pd.Period(2007, freq = 'A-DEC') # A-DEC 연말기준
p

Period('2007', 'A-DEC')

In [72]:
print(p+5)

2012

In [73]:
p-2

Period('2005', 'A-DEC')

In [74]:
# 기간을 타임스탬프로 변환
import numpy as np
rng = pd.period_range('2000-01-01',periods=3, freq='M')
ts = pd.Series(np.random.randn(3),index=rng)
print(ts,'\n')
ts.to_timestamp(how='end') # 마지막을 기준으로 timestamp로 바꿈

2000-01    1.322002
2000-02    0.796507
2000-03    1.474678
Freq: M, dtype: float64

2000-01-31 23:59:59.999999999    1.322002
2000-02-29 23:59:59.999999999    0.796507
2000-03-31 23:59:59.999999999    1.474678
dtype: float64

In [75]:
# Downsampling
rng = pd.date_range('2001-01-01',periods=12, freq='T') # T : 분 단위 ### 5T하면 5분 단위
ts = pd.Series(np.arange(12), index=rng)
ts

2001-01-01 00:00:00     0
2001-01-01 00:01:00     1
2001-01-01 00:02:00     2
2001-01-01 00:03:00     3
2001-01-01 00:04:00     4
2001-01-01 00:05:00     5
2001-01-01 00:06:00     6
2001-01-01 00:07:00     7
2001-01-01 00:08:00     8
2001-01-01 00:09:00     9
2001-01-01 00:10:00    10
2001-01-01 00:11:00    11
Freq: T, dtype: int64

In [76]:
ts.resample('5min',closed='right').sum() # closed='right' 를 설정해주면 기준이 바뀜
### 2000-12-31 23:55:00 ~ 5분은 없으니 0
### 2001-01-01 00:00:00 ~ 2001-01-01 00:05:00 다 더해서 15
### 2001-01-01 00:00:06 ~ 2001-01-01 00:10:00  다 더해서 40

2000-12-31 23:55:00     0
2001-01-01 00:00:00    15
2001-01-01 00:05:00    40
2001-01-01 00:10:00    11
Freq: 5T, dtype: int64

In [77]:
ts.resample('5min').sum()

2001-01-01 00:00:00    10
2001-01-01 00:05:00    35
2001-01-01 00:10:00    21
Freq: 5T, dtype: int64

In [78]:
ts.resample('5min').ohlc()

                     open  high  low  close
2001-01-01 00:00:00     0     4    0      4
2001-01-01 00:05:00     5     9    5      9
2001-01-01 00:10:00    10    11   10     11

In [79]:
frame = pd.DataFrame(np.random.randn(2,4),
                    index=pd.date_range('1/1/2000',periods=2,
                                       freq='W-WED'),
                    columns=['Colorado','Texas','New York','Ohio'])
frame

            Colorado     Texas  New York      Ohio
2000-01-05 -1.043670  0.893190  0.556636  1.263584
2000-01-12  3.407826  0.442196  1.219923  0.553873

In [80]:
df_daily = frame.resample('D').asfreq() # frame 은 데이터 2개 있음. 없는 곳은 NaN으로 나옴
df_daily

            Colorado     Texas  New York      Ohio
2000-01-05 -1.043670  0.893190  0.556636  1.263584
2000-01-06       NaN       NaN       NaN       NaN
2000-01-07       NaN       NaN       NaN       NaN
2000-01-08       NaN       NaN       NaN       NaN
2000-01-09       NaN       NaN       NaN       NaN
2000-01-10       NaN       NaN       NaN       NaN
2000-01-11       NaN       NaN       NaN       NaN
2000-01-12  3.407826  0.442196  1.219923  0.553873

In [81]:
frame.resample('D').ffill() # NaN을 앞에 있는 값으로 채움

            Colorado     Texas  New York      Ohio
2000-01-05 -1.043670  0.893190  0.556636  1.263584
2000-01-06 -1.043670  0.893190  0.556636  1.263584
2000-01-07 -1.043670  0.893190  0.556636  1.263584
2000-01-08 -1.043670  0.893190  0.556636  1.263584
2000-01-09 -1.043670  0.893190  0.556636  1.263584
2000-01-10 -1.043670  0.893190  0.556636  1.263584
2000-01-11 -1.043670  0.893190  0.556636  1.263584
2000-01-12  3.407826  0.442196  1.219923  0.553873

In [82]:
frame.resample('D').ffill(limit=2) # 앞에 두개만 제한해서 채우기

            Colorado     Texas  New York      Ohio
2000-01-05 -1.043670  0.893190  0.556636  1.263584
2000-01-06 -1.043670  0.893190  0.556636  1.263584
2000-01-07 -1.043670  0.893190  0.556636  1.263584
2000-01-08       NaN       NaN       NaN       NaN
2000-01-09       NaN       NaN       NaN       NaN
2000-01-10       NaN       NaN       NaN       NaN
2000-01-11       NaN       NaN       NaN       NaN
2000-01-12  3.407826  0.442196  1.219923  0.553873